<template>
  <div class="flex justify-content-center text-right">
    <Accordion style="width: 80%">
      <AccordionTab header="تعریف هنرمند و اثر">
        <p>
          هنرمند: به خواننده و گروه موسیقی، هنرمند گفته می شود.<br/>
          اثر: به آلبوم و آهنگ، اثر گفته می شود.
        </p>
      </AccordionTab>
      <AccordionTab header="عنوان، تگ گذاری، و جستجو">
        <p>
          جستجوی آثار و هنرمندان با عنوان و تگ های آن ها انجام می شود.
          بسیاری از مواقع کاربران عنوان آثار و هنرمندان مورد نظرشان را به شکلی دیگر جستجو می کنند.
          مثلا عبارت مورد نظرشان را فینگیلیش تایپ می کنند و به جای اِبی می نویسند Ebi.
          مورد دیگر زمانی است که عبارت مورد نظر
          به چند شکل مرسوم است. برای مثال بسیاری فدایی را فدائی
          تایپ می کنند.
          بدیهی است که شکل های مختلف یک عبارت را نمی توان در قسمت عنوان نوشت چون عنوان برای
          کاربران قابل مشاهده است.
          به همین دلیل در مواردی از این دست از تگ ها استفاده می شود.
          <br/>
          عنوان آثار و هنرمندان فارسی زبان
          باید عبارت فارسی آن ها باشد
           و در صورتی که شکل فینگیلیش یا شکلی
          دیگر نیز مرسوم است به عنوان یک تگ اضافه شود
          تا در اینصورت هم در نتایج جستجو پیدا شوند.<br/>
          در زیر مثال هایی آورده شده است.<br/>
          عنوان - - > تگ ها<br/>
          - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -<br/>
          اِبی - - > Ebi, ebi<br/>
          ویگن - - > Vigen, Viguen<br/>
          فدایی - - > فدائی, Fadaei<br/>
          Bach - - > باخ<br/>
          شجریان - - > Shajarian, Shajariaan
          <br/><br/>
          لازم است عنوان آثار و هنرمندان فارسی زبان، فارسی و عنوان آثار و
          هنرمندان خارجی، انگلیسی نوشته شود و اشکال دیگر در تگ ها گنجانده شود.<br/>
          در تگ ها نباید به هیچ عنوان از عبارات عمومی استفاده شود.
        </p>
      </AccordionTab>
      <AccordionTab header="انتخاب سبک برای هنرمندان و آثارشان">
        <p>
          قطعا باید برای تمامی آثار و هنرمندان سبک های درست و دقیق انتخاب شود
          چون سیستم برای امتیازدهی به آثار و هنرمندان و همینطور پیشنهاد به کاربران
          از سبک های آن ها استفاده می کند.<br/>
          سبک های قابل انتخاب برای آثار زیرمجموعه ای از سبک های هنرمند آن اثر است.
        </p>
      </AccordionTab>
      <AccordionTab header="انتشار/آرشیو هنرمندان و آثارشان">
        <p>
          هنرمندان و آثار ثبت شده در سیستم در صورت آرشیو بودن برای مشترکین قابل مشاهده نیستند.
          در صورتی که هنرمند یا اثری
          مثلا به دلیل نقص در اطلاعات، نبود عکس مناسب و موارد مشابه دیگر قابل ارائه به مشترکین
          نباشند، می توان آن ها را ثبت و آرشیو کرد و بعدا با رفع مشکلات منتشرشان کرد.<br/>
          با آرشیو یک هنرمند تمامی آثار آن هنرمند نیز آرشیو می شوند.<br/>
          هنرمندی که هیچ اثری ندارد و آلبومی که هیچ آهنگی ندارد منتشر نمی شوند.<br/>
          امکان انتشار اثری که هنرمندش آرشیو شده وحود ندارد و ابتدا باید هنرمند اثر منتشر شود.
        </p>
      </AccordionTab>
      <AccordionTab header="کاربرد علامت گذاری هنرمندان و آثارشان">
        <p>
          اگر اطلاعات هنرمند یا اثری که وارد می کنید ناقص است یا به هر دلیلی نیاز دارید
          که بعدا به آن مراجعه کنید می توانید از علامت گذاری استفاده کنید.
          متن علامت گذاری تنها برای
          مدیران سیستم قابل مشاهده است و صرفا برای جلوگیری از گم شدن هنرمند یا اثری است که
          نیاز به بازبینی دارد.
        </p>
      </AccordionTab>
      <AccordionTab header="محاسبه امتیاز هنرمندان و آثارشان">
        <p>
          سیستم در فواصل مشخص هنرمندان و آثارشان را بر اساس محبوبیتشان در سبک شان امتیازدهی می کند.
          به عبارت دیگر هنرمندان و آثار هر سبک به صورت مجزا بر اساس محبوبیتشان در آن سبک رتبه بندی
          می شوند.<br/>
          هنرمند و اثری که امتیاز بیشتری دارد در نتایج جستجو بالاتر قرار می گیرد.
        </p>
      </AccordionTab>
      <AccordionTab header="پیشنهاد به کاربران بر اساس سلایق شان">
        <p>
          پیشنهاد به کاربران بر اساس سبک های مورد علاقه شان صورت می گیرد.
        </p>
      </AccordionTab>
      <AccordionTab header="ویترین">
        <p>
          آیتم های
          ویترین توسط مدیر سیستم ایجاد می شوند و برای promotion یک اثر یا هنرمند استفاده می شوند.
        </p>
      </AccordionTab>
      <AccordionTab header="گزارشات و چگونگی پردازش آن ها">
        <p>
          گزارشات به دو دسته فنی و محتوایی تقسیم می شوند.<br/>
          منظور از گزارش فنی مواردی
          مثل مشکل صدا، عدم امکان استفاده از یک قسمت و مواردی از این دست است.
          منظور از گزارش محتوایی مواردی مثل لیریک نادرست است.<br/>
          گزارش های مرتبط به یک هنرمند یا اثر برای بررسی
          و رفع اشکال برای کاربر ایجاد کننده آن هنرمند یا اثر ارسال می شوند.<br/>
          متن یادداشت پردازش کننده تنها برای مدیران سیستم قابل مشاهده است و باید حاوی
            اقداماتی باشد که پردازش کننده برای رفع مشکل انجام داده است.<br/>
            گزارشاتی که مختص هنرمند یا اثر خاصی نیست برای مدیر سیستم ارسال می شوند.
        </p>
      </AccordionTab>
    </Accordion>
  </div>
</template>

<style lang="scss" scoped>

</style>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({});
</script>
